package ДЗ_семинар1;

/*
 * Дан список. Выведите те его элементы, которые встречаются в списке только один раз. 
 * Элементы нужно выводить в том порядке, в котором они встречаются в списке.
 * Вводится список чисел. Все числа списка находятся на одной строке.
 */

public class Task07 {
    public static void main(String[] args) {

    }
}

// Позже вернусь
// На python так:

// a = list(map(int, input().split()))
// d = dict()
// for i in a:
//     if i not in d:
//         d[i] = 1
//     else:
//         d[i] += 1
// print(' '.join(map(str, [i for i in d if d[i] == 1])))