package ДЗ_семинар1;

/*
 * Вводится массив (сначала количество элементов, потом сами элементы). 
 * Найдите сумму его элементов с чётными индексами и выведите её. 
 * А потом выведите числа, которые суммировались.
 */

public class Task06 {
    public static void main(String[] args) {

    }
}

// Позже вернусь
// На python так:

// from random import randint as g

// s, l = 0, [g(-10, 10) for i in range(g(10, 20))]

// for i in l: if i % 2 else (s := s + i)

// print(f'{l}\nСумма чётных: ')